//С помощью нее происходит считывание данных, но эти данные нужно сохранить. *Переменная, тип данных*
//String - строки
//Присваиваем имя переменной, идентификатор переменной. В данном случае username.
Console.WriteLine("Введите ваше имя ");                 // WriteLine - вывести что-то в окно терминала, в данном случае текст
string username = Console.ReadLine();                   // Console.ReadLine - с помощью нее происходит считывание данных, но эти данные нужно где-то сохранить. (Переменная, тип данных). String - строки
Console.Write("Привет, ");                              // Write - вывести что-то в окно терминала, в данном случае текст (в одну строку)
Console.Write(username);                                // Write - вывести что-то в окно терминала, в данном случае текст (в одну строку)